caAERS/software/web/1.xml

<!--
  Copyright SemanticBits, Northwestern University and Akaza Research
  
  Distributed under the OSI-approved BSD 3-Clause License.
  See http://ncip.github.com/caaers/LICENSE.txt for details.
-->
<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:stud="http://schema.integration.caaers.cabig.nci.nih.gov/study"
        xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <soapenv:Header>
        <wsse:Security>
            <wsse:UsernameToken>
                <wsse:Username>SYSTEM_ADMIN</wsse:Username>
                <wsse:Password>Hello-12</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <stud:updateStudy>
            <!--Optional:-->
            <stud:studies>

                <!-- STUDY START -->
                <stud:study>
                    <shortTitle>TestRules14</shortTitle>
                    <phaseCode>Phase I Trial</phaseCode>
                    <otherMeddra>MedDRA v10</otherMeddra>
                    <studyPurpose>Treatment</studyPurpose>
                    <aeTermUnique>true</aeTermUnique>
                    <stud:aeTerminology><stud:ctcVersion><name>4</name></stud:ctcVersion></stud:aeTerminology>
                    <stud:diseaseTerminology><diseaseCodeTerm>CTEP</diseaseCodeTerm></stud:diseaseTerminology>

                    <fundingSponsor>
                        <organizationAssignedIdentifier><value>12345A</value></organizationAssignedIdentifier>
                        <stud:studyFundingSponsor>
                            <stud:organization>
                                <name>Cancer Therapy Evaluation Program</name>
                                <nciInstituteCode>CTEP</nciInstituteCode>
                            </stud:organization>
                        </stud:studyFundingSponsor>
                    </fundingSponsor>

                    <coordinatingCenter>
                        <organizationAssignedIdentifier>
                            <value>12345A</value>
                        </organizationAssignedIdentifier>
                        <stud:studyCoordinatingCenter>
                            <stud:organization>
                                <name>Cancer Therapy Evaluation Program</name>
                                <nciInstituteCode>CTEP</nciInstituteCode>
                            </stud:organization>
                        </stud:studyCoordinatingCenter>
                    </coordinatingCenter>

                    <studyOrganizations>
                        <stud:studySite>
                            <stud:organization>
                                <name>Howard University Hospital</name>
                                <nciInstituteCode>DC006</nciInstituteCode>
                            </stud:organization>
                        </stud:studySite>
                    </studyOrganizations>

                </stud:study>
                <!-- STUDY END -->
            </stud:studies>
        </stud:updateStudy>
    </soapenv:Body>
</soapenv:Envelope>
